
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 5 to change, 8 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.create_updates_queue_listen_conn_str
  * azurerm_key_vault_secret.create_updates_queue_send_conn_str
  * azurerm_key_vault_secret.update_case_queue_listen_conn_str
  * azurerm_key_vault_secret.update_case_queue_send_conn_str
  * module.et-key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
* Replace
  * module.create-updates-queue.azurerm_servicebus_queue.servicebus_queue
  * module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.update-case-queue.azurerm_servicebus_queue.servicebus_queue
  * module.update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.create_updates_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_listen_conn_str" {
        id             = "https://et-aat.vault.azure.net/secrets/create-updates-queue-listen-connection-string/bfe29136683144ccb8695fb14bc06d6b"
        name           = "create-updates-queue-listen-connection-string"
        tags           = {}
      ~ value          = (sensitive value)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_send_conn_str" {
        id             = "https://et-aat.vault.azure.net/secrets/create-updates-queue-send-connection-string/b7073fb8ea4a4df2be3361e8e431618e"
        name           = "create-updates-queue-send-connection-string"
        tags           = {}
      ~ value          = (sensitive value)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_listen_conn_str" {
        id             = "https://et-aat.vault.azure.net/secrets/update-case-queue-listen-connection-string/e8b92489a33c43b28ca9a02681ec5f34"
        name           = "update-case-queue-listen-connection-string"
        tags           = {}
      ~ value          = (sensitive value)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_send_conn_str" {
        id             = "https://et-aat.vault.azure.net/secrets/update-case-queue-send-connection-string/37a88fbfb44f45fc913220471a3e3302"
        name           = "update-case-queue-send-connection-string"
        tags           = {}
      ~ value          = (sensitive value)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.create-updates-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/create-updates" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "create-updates"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat-premium" # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/create-updates/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/create-updates" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/create-updates/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/create-updates" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.et-key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat|et-aat"
        name                       = "et-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be destroyed
  # (because azurerm_servicebus_namespace.servicebus_namespace is not in configuration)
  - resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      - capacity                            = 0 -> null
      - default_primary_connection_string   = (sensitive value)
      - default_primary_key                 = (sensitive value)
      - default_secondary_connection_string = (sensitive value)
      - default_secondary_key               = (sensitive value)
      - id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat" -> null
      - local_auth_enabled                  = true -> null
      - location                            = "uksouth" -> null
      - name                                = "et-aat" -> null
      - resource_group_name                 = "et-aat" -> null
      - sku                                 = "Standard" -> null
      - tags                                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
          - "application"         = "employment-tribunals"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#et-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Employment Tribunals"
        } -> null
      - zone_redundant                      = false -> null
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule will be destroyed
  # (because azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule is not in configuration)
  - resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      - id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/AuthorizationRules/SendAndListenSharedAccessKey" -> null
      - listen                      = true -> null
      - manage                      = false -> null
      - name                        = "SendAndListenSharedAccessKey" -> null
      - namespace_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat" -> null
      - primary_connection_string   = (sensitive value)
      - primary_key                 = (sensitive value)
      - secondary_connection_string = (sensitive value)
      - secondary_key               = (sensitive value)
      - send                        = true -> null
    }

  # module.update-case-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/update-case" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "update-case"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat-premium" # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/update-case/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/update-case" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/update-case/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/update-case" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 6 to add, 5 to change, 8 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule has changed
  ~ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/create-updates/authorizationRules/ListenSharedAccessKey"
        name                        = "ListenSharedAccessKey"
      ~ primary_connection_string   = (sensitive value)
      ~ secondary_connection_string = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule has changed
  ~ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/create-updates/authorizationRules/SendSharedAccessKey"
        name                        = "SendSharedAccessKey"
      ~ primary_connection_string   = (sensitive value)
      ~ secondary_connection_string = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.servicebus-namespace-premium.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule has changed
  ~ resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat-premium/AuthorizationRules/SendAndListenSharedAccessKey"
        name                        = "SendAndListenSharedAccessKey"
      ~ primary_connection_string   = (sensitive value)
      ~ primary_key                 = (sensitive value)
      ~ secondary_connection_string = (sensitive value)
      ~ secondary_key               = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule has changed
  ~ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/update-case/authorizationRules/ListenSharedAccessKey"
        name                        = "ListenSharedAccessKey"
      ~ primary_connection_string   = (sensitive value)
      ~ secondary_connection_string = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule has changed
  ~ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat/queues/update-case/authorizationRules/SendSharedAccessKey"
        name                        = "SendSharedAccessKey"
      ~ primary_connection_string   = (sensitive value)
      ~ secondary_connection_string = (sensitive value)
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":42,"Program":"tfcmt","SHA1":"","Vars":{}} -->